Pandas는 두 개 이상의 데이터프레임을 하나로 합치는 데이터 병합(merge)이나 연결(concatenate)을 지원한다.

In [4]:
import pandas as pd
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])

# Merge

`merge` 명령은 두 데이터 프레임의 공통 열 혹은 인덱스를 기준으로 두 개의 테이블을 합친다. 이 때 기준이 되는 열, 행의 데이터를 **키(key)**라고 한다.

In [5]:
display(df1,df2)

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

- `merge` 명령으로 위의 두 데이터프레임 df1, df2 를 합치면 공통 열인 `고객번호` 열을 기준으로 데이터를 찾아서 합친다.
- KEY(기준이 되는 열) 에 대해서 겹쳐서 존재하는 경우(1001번) 중복되어서 들어가게 된다.
- 이 때 기본적으로는 양쪽 데이터프레임에 모두 키가 존재하는 데이터만 보여주는 inner join 방식을 사용한다.

In [50]:
pd.merge(df1, df2)

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

- outer join 방식은 키 값이 한쪽에만 있어도 데이터를 보여준다.

In [51]:
pd.merge(df1, df2, how='outer')

   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

- left, right 방식은 각각 첫번째, 혹은 두번째 데이터프레임의 키 값을 모두 보여준다.

In [6]:
# left(df1) 의 경우는 모두 보여준다.
# df2 의 경우는 df1 의 키(고객번호) 에 맞게 옆에 붙여진다. 다만, df1 의 키에 해당하지 않는경우 가차없이 버려진다.
pd.merge(df1, df2, how='left')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [8]:
# 이 경우 right(df2) 가 모두 보여진다.
pd.merge(df1, df2, how='right')

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1001   둘리   30000
3  1005   희동   15000
4  1006  마이콜    5000
5  1008  NaN  100000

## 병합기준 (key)

In [9]:
df1 = pd.DataFrame({
    '품종': ['setosa', 'setosa', 'virginica', 'virginica'],
    '꽃잎길이': [1.4, 1.3, 1.5, 1.3]},
    columns=['품종', '꽃잎길이'])
df2 = pd.DataFrame({
    '품종': ['setosa', 'virginica', 'virginica', 'versicolor'],
    '꽃잎너비': [0.4, 0.3, 0.5, 0.3]},
    columns=['품종', '꽃잎너비'])

In [11]:
display(df1,df2)

          품종  꽃잎길이
0     setosa   1.4
1     setosa   1.3
2  virginica   1.5
3  virginica   1.3

           품종  꽃잎너비
0      setosa   0.4
1   virginica   0.3
2   virginica   0.5
3  versicolor   0.3

- 만약 테이블에 키 값이 같은 데이터가 여러개 있는 경우에는 있을 수 있는 모든 경우의 수를 따져서 조합을 만들어 낸다.
- 이 데이터에서 키 값 setosa에 대해 왼쪽 데이터프레임는 1.4와 1.3라는 2개의 데이터, 오른쪽 데이터프레임에 0.4라는 1개의 데이터가 있으므로 병합된 데이터에는 setosa가 (1.4, 0.4), (1.3, 0.4) 두 개의 데이터가 생긴다. 
- 키 값 virginica의 경우에는 왼쪽 데이터프레임에 1.5와 1.3라는 2개의 데이터, 오른쪽 데이터프레임에 0.3와 0.5라는 2개의 데이터가 있으므로 2개와 2개의 조합에 의해 4가지 값이 생긴다.

In [12]:
pd.merge(df1, df2)

          품종  꽃잎길이  꽃잎너비
0     setosa   1.4   0.4
1     setosa   1.3   0.4
2  virginica   1.5   0.3
3  virginica   1.5   0.5
4  virginica   1.3   0.3
5  virginica   1.3   0.5

## key 정해주기

두 데이터프레임에서 이름이 같은 열은 모두 키가 된다. 만약 이름이 같아도 키가 되면 안되는 열이 있다면 `on` 인수로 기준열을 명시해야 한다. 다음 예에서 첫번째 데이터프레임의 "데이터"는 실제로는 금액을 나타내는 데이터이고 두번째 데이터프레임의 "데이터"는 실제로는 성별을 나타내는 데이터이므로 이름이 같아도 다른 데이터이다. 따라서 이 열은 기준열이 되면 안된다.

In [57]:
df1 = pd.DataFrame({
    '고객명': ['춘향', '춘향', '몽룡'],
    '날짜': ['2018-01-01', '2018-01-02', '2018-01-01'],
    '데이터': ['20000', '30000', '100000']})
df1

  고객명          날짜     데이터
0  춘향  2018-01-01   20000
1  춘향  2018-01-02   30000
2  몽룡  2018-01-01  100000

In [58]:
df2 = pd.DataFrame({
    '고객명': ['춘향', '몽룡'],
    '데이터': ['여자', '남자']})
df2

  고객명 데이터
0  춘향  여자
1  몽룡  남자

In [59]:
pd.merge(df1,df2) 
# key 는 자동으로 겹치는 데이터 / 고객명이 되게 된다.
# 하지만 응~ defalut 는 inner 방식이기 떄문에 고객명과 데이터 둘다 겹치는 경우가 없으니까 빈 dataframe 나와~

Empty DataFrame
Columns: [고객명, 날짜, 데이터]
Index: []

In [60]:
pd.merge(df1, df2, on='고객명')
# 고객명을 명시하자. 그러면 고객명 이 키가 되어서, col 이겹쳐도 얘만 기준으로해서 다 잘되~ 굳굳굳굳굳굳굳굳굳굳

  고객명          날짜   데이터_x 데이터_y
0  춘향  2018-01-01   20000    여자
1  춘향  2018-01-02   30000    여자
2  몽룡  2018-01-01  100000    남자

이 때 기준 열이 아니면서 이름이 같은 열에는 `_x` 또는 `_y` 와 같은 접미사가 붙는다.

## key 기준 col이 다름

반대로 키가 되는 기준열의 이름이 두 데이터프레임에서 다르다면 `left_on`, `right_on` 인수를 사용하여 기준열을 명시해야 한다.

In [68]:
df1 = pd.DataFrame({
    '이름': ['영희', '철수', '철수'],
    '성적': [1, 2, 3]})
df1

   이름  성적
0  영희   1
1  철수   2
2  철수   3

In [69]:
df2 = pd.DataFrame({
    '성명': ['영희', '영희', '철수'],
    '성적2': [4, 5, 6]})
df2

   성명  성적2
0  영희    4
1  영희    5
2  철수    6

In [71]:
pd.merge(df1, df2, left_on='이름', right_on="성명")
# 아 두 col 이 사실 같은거를 가르키는데 이름이 다르네..?? 그러면 left 의 df 의 key는 이름 으로 / right df 의 key 는 성명이라고 하자. 
# 사실 그냥 col 명 바꾸고 하는게 나아보인다..

   이름  성적  성명  성적2
0  영희   1  영희    4
1  영희   1  영희    5
2  철수   2  철수    6
3  철수   3  철수    6

# 인덱스 기준

일반 데이터 열이 아닌 인덱스를 기준열로 사용하려면 `left_index` 또는 `right_index` 인수를 `True` 로 설정한다.

## 인덱스 , Col 합치기

In [103]:
df1 = pd.DataFrame({
    '도시': ['서울', '서울', '서울', '부산', '부산'],
    '연도': [2000, 2005, 2010, 2000, 2005],
    '인구': [9853972, 9762546, 9631482, 3655437, 3512547]})
df1

   도시    연도       인구
0  서울  2000  9853972
1  서울  2005  9762546
2  서울  2010  9631482
3  부산  2000  3655437
4  부산  2005  3512547

In [104]:
df2 = pd.DataFrame(
    np.arange(12).reshape((6, 2)),
    index=[['부산', '부산', '서울', '서울', '서울', '서울'],
           [2000, 2005, 2000, 2005, 2010, 2015]],
    columns=['데이터1', '데이터2'])
df2

         데이터1  데이터2
부산 2000     0     1
   2005     2     3
서울 2000     4     5
   2005     6     7
   2010     8     9
   2015    10    11

In [105]:
pd.merge(df1, df2, left_on=['도시', '연도'], right_index=True) 
# 이경우 df2 의 index 가 2dim 인덱스여서 left_on 이 2개의 list 가 되야한다...
# index 와

   도시    연도       인구  데이터1  데이터2
0  서울  2000  9853972     4     5
1  서울  2005  9762546     6     7
2  서울  2010  9631482     8     9
3  부산  2000  3655437     0     1
4  부산  2005  3512547     2     3

## 인덱스 , 인덱스 합치기

In [140]:
df1 = pd.DataFrame(
    [[1., 2.], [3., 4.], [5., 6.]],
    index=['a', 'c', 'e'],
    columns=['서울', '부산'])
df1

    서울   부산
a  1.0  2.0
c  3.0  4.0
e  5.0  6.0

In [141]:
df2 = pd.DataFrame(
    [[1., 8.], [5., 10.], [11., 12.], [13, 14]],
    index=['b', 'c', 'd', 'e'],
    columns=['독일', '광주'])
df2

     독일    광주
b   1.0   8.0
c   5.0  10.0
d  11.0  12.0
e  13.0  14.0

In [142]:
pd.merge(df1, df2,right_index=True, on='서울' )

KeyError: '서울'

In [143]:
pd.merge(df1, df2, how='outer', left_index=True, right_index=True) 
# outer 여서 index 만 합쳐지는 모습

    서울   부산    독일    광주
a  1.0  2.0   NaN   NaN
b  NaN  NaN   1.0   8.0
c  3.0  4.0   5.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

### join 메서드

`merge` 명령어 대신 `join` 메서드를 사용할 수도 있다.

In [22]:
df1.join(df2, how='outer')

    서울   부산    대구    광주
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

In [111]:
import pandas as pd
from pandas import DataFrame
df_left = DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']},
                    index=['K0', 'K1', 'K2', 'K3'])
df_right = DataFrame({'C': ['C2', 'C3', 'C4', 'C5'],
                      'D': ['D2', 'D3', 'D4', 'D5']},
                     index=['K2', 'K3', 'K4', 'K5'])

In [113]:
df_left

     C   D
K2  C2  D2
K3  C3  D3
K4  C4  D4
K5  C5  D5

In [116]:
df_right

     C   D
K2  C2  D2
K3  C3  D3
K4  C4  D4
K5  C5  D5

(1) index를 기준으로 Left Join 하기 (Left join on index)

In [117]:
pd.merge(df_left, df_right, left_index=True, right_index=True,how='left')

     A   B    C    D
K0  A0  B0  NaN  NaN
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2
K3  A3  B3   C3   D3

index를 기준으로 Right Join 하기 (Right join on index)

In [121]:
pd.merge(df_left, df_right, left_index=True, right_index=True,how='right')

      A    B   C   D
K2   A2   B2  C2  D2
K3   A3   B3  C3  D3
K4  NaN  NaN  C4  D4
K5  NaN  NaN  C5  D5

index를 기준으로 inner merge 하기 (안겹치는거 있으면 삭제)

In [122]:
pd.merge(df_left, df_right, left_index=True, right_index=True,how='inner')

     A   B   C   D
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

index를 기준으로 outer merge 하기 ( 안겹치는거 있어도, key 가 되는 col(여기서는 index 가 기준이 될 것) 에 대해서 모두 표시해준다.)

In [124]:
pd.merge(df_left, df_right, left_index=True, right_index=True,how='outer')

      A    B    C    D
K0   A0   B0  NaN  NaN
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3   A3   B3   C3   D3
K4  NaN  NaN   C4   D4
K5  NaN  NaN   C5   D5